xemacs/elpa/pkgs/org-capture+/org-capture+.el
;; Required libraries

;; [[file:~/.xemacs/elpa/pkgs/org-capture+/org-capture+.org::*Required%20libraries][Required libraries:1]]
(require 'org-capture)
;; Required libraries:1 ends here
